; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-4)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	infrared1 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Planet5)
	(have_image Planet3 infrared1)
	(have_image Star4 infrared1)
	(have_image Planet5 thermograph2)
	(have_image Star6 infrared1)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon9 infrared0)
))

)

; plan
1. (turn_to satellite1 star2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star2)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 planet3 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet3)
   goals met: 0 of 8
5. (take_image satellite1 planet3 instrument1 infrared1)
   added: (have_image planet3 infrared1)
   goals met: 1 of 8
6. (turn_to satellite1 star4 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 star4)
   goals met: 1 of 8
7. (take_image satellite1 star4 instrument1 infrared1)
   added: (have_image star4 infrared1)
   goals met: 2 of 8
8. (turn_to satellite1 star6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star6)
   goals met: 2 of 8
9. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 3 of 8
10. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 3 of 8
11. (take_image satellite1 star7 instrument1 infrared0)
   added: (have_image star7 infrared0)
   goals met: 4 of 8
12. (turn_to satellite1 phenomenon9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 8
13. (take_image satellite1 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 8
14. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 8
15. (take_image satellite1 phenomenon8 instrument1 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite1 planet5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet5)
   goals met: 7 of 8
17. (take_image satellite1 planet5 instrument1 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 8 of 8
